<template>
  <div>
    <divider title="درباره شرکت" />
    <m-read-more
      text="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
        گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و
        برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای
        کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان
        جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
        ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می
        توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل
        دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
    />
    <divider title="تصاویر شرکت" class="mt-8" />
    <div class="grid grid-cols-2 gap-6">
      <NuxtImg src="/images/single-job-2.png" class="w-full"/>
      <NuxtImg src="/images/single-job-3.png" class="w-full"/>
      <NuxtImg src="/images/single-job-4.png" class="w-full"/>
      <NuxtImg src="/images/single-job-5.png" class="w-full"/>
    </div>
  </div>
</template>

<script setup lang="ts">
import Divider from './Divider.vue';

// Parameters
const items = ref<any[]>([
  { title: 'نرم‌فزار: سپیدار', icon: 'single-job-1' },
  { title: 'حقوق: 25 میلیون تومان', icon: 'single-job-1' },
  { title: 'سابقه کاری: بین 3 تا 6 سال', icon: 'single-job-1' },
]);
const showLess = ref(true);
const conditions = ref<any[]>([
  'آشنایی با نرم افزارهای حسابداری',
  'توانایی کار به صورت تیمی ',
  'آشنایی با اصول و استاندارد های حسابداری',
  'مهارت در تهیه گزارش های مالی ',
]);
const benefits = ref<any[]>([
  'محیط پویا و صمیمی',
  'فضای رشد و یادگیری',
  'آشنایی با اصول و استاندارد های حسابداری',
  'مهارت در تهیه گزارش های مالی',
]);
const skils = ref<any[]>([
  { title: 'شناخت از مالیات به ارزش افزوده', value: 20 },
  { title: 'شناخت از مالیات عملکرد', value: 20 },
  { title: 'شناخت از مالیات موضوعات بیمه پرسنلی', value: 20 },
  { title: 'شناخت از مالیات سامانه مودیان', value: 20 },
]);
</script>
